CreateTicketSOAP.txt

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<S:Header>
<wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">ws://xyzag.com/SUP/EnterpriseServices/TicketManagementService/V1</wsa:To>
<wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://xmldefs.volkswagenag.com/SUP/EnterpriseServices/TicketManagementService/V1/TicketManagementServicePortType/CreateTicket</wsa:Action>
<wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:uuid:b860707d-b503-45a6-95881202011231045</wsa:MessageID>
<!--  The stage can be Test, QualityAssurance, PreLive, Production, it depends on which stage the request will be sent to  -->
<!--  Please pay attention, the stage is case sensitiv  -->
<vwa:Stage xmlns:vwa="http://xmldefs.volkswagenag.com/Technical/Addressing/V1" xmlns:wsa="http://www.w3.org/2005/08/addressing" wsa:IsReferenceParameter="true">Test</vwa:Stage>
<vwa:System xmlns:vwa="http://xmldefs.volkswagenag.com/Technical/Addressing/V1" xmlns:wsa="http://www.w3.org/2005/08/addressing" wsa:IsReferenceParameter="true">ICTO-7610</vwa:System>
<wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing">
<wsa:ReferenceParameters>
<vwa:Stage xmlns:vwa="http://xmldefs.xyzag.com/Technical/Addressing/V1">Test</vwa:Stage>
<vwa:System xmlns:vwa="http://xmldefs.xyzag.com/Technical/Addressing/V1">ICTO-12345</vwa:System>
</wsa:ReferenceParameters>
</wsa:ReplyTo>
</S:Header>
<S:Body>
<ns6:CreateTicket xmlns="http://xmldefs.xyzag.com/DD/ITServiceTicket/V1" xmlns:ns2="http://xmldefs.xyzag.com/DD/ITServiceTicket/Ref/V1" xmlns:ns3="http://xmldefs.xyzag.com/DD/User/Ref/V1" xmlns:ns4="http://xmldefs.volkswagenag.com/DD/User/V2" xmlns:ns5="http://xmldefs.volkswagenag.com/DD/Commons" xmlns:ns6="http://xmldefs.volkswagenag.com/SUP/EnterpriseServices/TicketManagementService/V1">
<ITServiceTicket>
<ns2:ITServiceTicketRef>
<ns2:ApplicationIdentifiers>
<ns2:ID>TEST0000015</ns2:ID>
</ns2:ApplicationIdentifiers>
</ns2:ITServiceTicketRef>
<Title>TEST01-test01 - with own title</Title>
<Kind>IncidentManagement</Kind>
<Type>Incident</Type>
<Categories>
<Category>
<CategoryName>Monitoring</CategoryName>
<CategoryLevel>1</CategoryLevel>
</Category>
<Category>
<CategoryName>Monitoring2</CategoryName>
<CategoryLevel>2</CategoryLevel>
</Category>
<Category>
<CategoryName>Monitoring3</CategoryName>
<CategoryLevel>3</CategoryLevel>
</Category>
</Categories>
<Groups>
<Group>
<GroupType>assignment</GroupType>
<GroupName>Zebra Support Group</GroupName>
</Group>
</Groups>
<Source>YOUR_APPLICATION</Source>
<!--  Please pay attention, the callcode is case sensitiv  -->
<InboundChannel>YOUR_CALLCODE</InboundChannel>
<ConfigurationItems>
<ConfigurationItem>
<Name>ZEBRA</Name>
</ConfigurationItem>
</ConfigurationItems>
<Description>your description here</Description>
<Priority>3</Priority>
<!-- Dates>
               <DateInformation>
                  <DateType>outage_from</DateType>
                  <Date>2020-03-03T14:48:20.000+00:00</Date>
               </DateInformation>
            </Dates  -->
<ContactInformation>
<TicketOwner>
<ns4:User>
<ns4:UserIdentifier>
<ns3:UserID>SCUR031</ns3:UserID>
</ns4:UserIdentifier>
</ns4:User>
</TicketOwner>
<!--  AlternativeContacts>
						<AlternativeContact>
							<ns4:User>
								<ns4:UserIdentifier>
									<ns3:UserID>SCUR032</ns3:UserID>
								</ns4:UserIdentifier>
							</ns4:User>
						</AlternativeContact>
					</AlternativeContacts  -->
</ContactInformation>
<!--  Attachments>
					<Attachment>
						<File mimeCode="text/plain" filename="Test.txt">VGVzdA==</File>
					</Attachment>
					<Attachment>
						<File mimeCode="text/plain" filename="Test2.txt">SW5oYWx0IG1laW5lciB0b2xsZW4gRGF0ZWk=</File>
					</Attachment>
				</Attachments  -->
</ITServiceTicket>
</ns6:CreateTicket>
</S:Body>
</S:Envelope>